zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/include/pio/pic32cm6408pl10064.h
#define PIN_PA24B_ADC0_AIN24                       _UINT32_(24)
#define MUX_PA24B_ADC0_AIN24                       _UINT32_(1) 
#define PINMUX_PA24B_ADC0_AIN24                    ((PIN_PA24B_ADC0_AIN24 << 16) | MUX_PA24B_ADC0_AIN24)
#define PORT_PA24B_ADC0_AIN24                      (_UINT32_(1) << 24)

#define PIN_PA25B_ADC0_AIN25                       _UINT32_(25)
#define MUX_PA25B_ADC0_AIN25                       _UINT32_(1) 
#define PINMUX_PA25B_ADC0_AIN25                    ((PIN_PA25B_ADC0_AIN25 << 16) | MUX_PA25B_ADC0_AIN25)
#define PORT_PA25B_ADC0_AIN25                      (_UINT32_(1) << 25)

#define PIN_PA26B_ADC0_AIN26                       _UINT32_(26)
#define MUX_PA26B_ADC0_AIN26                       _UINT32_(1) 
#define PINMUX_PA26B_ADC0_AIN26                    ((PIN_PA26B_ADC0_AIN26 << 16) | MUX_PA26B_ADC0_AIN26)
#define PORT_PA26B_ADC0_AIN26                      (_UINT32_(1) << 26)

#define PIN_PA27B_ADC0_AIN27                       _UINT32_(27)
#define MUX_PA27B_ADC0_AIN27                       _UINT32_(1) 
#define PINMUX_PA27B_ADC0_AIN27                    ((PIN_PA27B_ADC0_AIN27 << 16) | MUX_PA27B_ADC0_AIN27)
#define PORT_PA27B_ADC0_AIN27                      (_UINT32_(1) << 27)

#define PIN_PA28B_ADC0_AIN28                       _UINT32_(28)
#define MUX_PA28B_ADC0_AIN28                       _UINT32_(1) 
#define PINMUX_PA28B_ADC0_AIN28                    ((PIN_PA28B_ADC0_AIN28 << 16) | MUX_PA28B_ADC0_AIN28)
#define PORT_PA28B_ADC0_AIN28                      (_UINT32_(1) << 28)

#define PIN_PA29B_ADC0_AIN29                       _UINT32_(29)
#define MUX_PA29B_ADC0_AIN29                       _UINT32_(1) 
#define PINMUX_PA29B_ADC0_AIN29                    ((PIN_PA29B_ADC0_AIN29 << 16) | MUX_PA29B_ADC0_AIN29)
#define PORT_PA29B_ADC0_AIN29                      (_UINT32_(1) << 29)

#define PIN_PA31B_ADC0_AIN31                       _UINT32_(31)
#define MUX_PA31B_ADC0_AIN31                       _UINT32_(1) 
#define PINMUX_PA31B_ADC0_AIN31                    ((PIN_PA31B_ADC0_AIN31 << 16) | MUX_PA31B_ADC0_AIN31)
#define PORT_PA31B_ADC0_AIN31                      (_UINT32_(1) << 31)

#define PIN_PB08B_ADC0_AIN40                       _UINT32_(40)
#define MUX_PB08B_ADC0_AIN40                       _UINT32_(1) 
#define PINMUX_PB08B_ADC0_AIN40                    ((PIN_PB08B_ADC0_AIN40 << 16) | MUX_PB08B_ADC0_AIN40)
#define PORT_PB08B_ADC0_AIN40                      (_UINT32_(1) << 8)

#define PIN_PB09B_ADC0_AIN41                       _UINT32_(41)
#define MUX_PB09B_ADC0_AIN41                       _UINT32_(1) 
#define PINMUX_PB09B_ADC0_AIN41                    ((PIN_PB09B_ADC0_AIN41 << 16) | MUX_PB09B_ADC0_AIN41)
#define PORT_PB09B_ADC0_AIN41                      (_UINT32_(1) << 9)

#define PIN_PB10B_ADC0_AIN42                       _UINT32_(42)
#define MUX_PB10B_ADC0_AIN42                       _UINT32_(1) 
#define PINMUX_PB10B_ADC0_AIN42                    ((PIN_PB10B_ADC0_AIN42 << 16) | MUX_PB10B_ADC0_AIN42)
#define PORT_PB10B_ADC0_AIN42                      (_UINT32_(1) << 10)

#define PIN_PB11B_ADC0_AIN43                       _UINT32_(43)
#define MUX_PB11B_ADC0_AIN43                       _UINT32_(1) 
#define PINMUX_PB11B_ADC0_AIN43                    ((PIN_PB11B_ADC0_AIN43 << 16) | MUX_PB11B_ADC0_AIN43)
#define PORT_PB11B_ADC0_AIN43                      (_UINT32_(1) << 11)

#define PIN_PB12B_ADC0_AIN44                       _UINT32_(44)
#define MUX_PB12B_ADC0_AIN44                       _UINT32_(1) 
#define PINMUX_PB12B_ADC0_AIN44                    ((PIN_PB12B_ADC0_AIN44 << 16) | MUX_PB12B_ADC0_AIN44)
#define PORT_PB12B_ADC0_AIN44                      (_UINT32_(1) << 12)

#define PIN_PB13B_ADC0_AIN45                       _UINT32_(45)
#define MUX_PB13B_ADC0_AIN45                       _UINT32_(1) 
#define PINMUX_PB13B_ADC0_AIN45                    ((PIN_PB13B_ADC0_AIN45 << 16) | MUX_PB13B_ADC0_AIN45)
#define PORT_PB13B_ADC0_AIN45                      (_UINT32_(1) << 13)

#define PIN_PB14B_ADC0_AIN46                       _UINT32_(46)
#define MUX_PB14B_ADC0_AIN46                       _UINT32_(1) 
#define PINMUX_PB14B_ADC0_AIN46                    ((PIN_PB14B_ADC0_AIN46 << 16) | MUX_PB14B_ADC0_AIN46)
#define PORT_PB14B_ADC0_AIN46                      (_UINT32_(1) << 14)

#define PIN_PB15B_ADC0_AIN47                       _UINT32_(47)
#define MUX_PB15B_ADC0_AIN47                       _UINT32_(1) 
#define PINMUX_PB15B_ADC0_AIN47                    ((PIN_PB15B_ADC0_AIN47 << 16) | MUX_PB15B_ADC0_AIN47)
#define PORT_PB15B_ADC0_AIN47                      (_UINT32_(1) << 15)

#define PIN_PA23B_ADC0_VREFP                       _UINT32_(23)
#define MUX_PA23B_ADC0_VREFP                       _UINT32_(1) 
#define PINMUX_PA23B_ADC0_VREFP                    ((PIN_PA23B_ADC0_VREFP << 16) | MUX_PA23B_ADC0_VREFP)
#define PORT_PA23B_ADC0_VREFP                      (_UINT32_(1) << 23)

/* =================== PORT definition for CCL peripheral =================== */
#define PIN_PA00H_CCL_IN0                          _UINT32_(0) 
#define MUX_PA00H_CCL_IN0                          _UINT32_(7) 
#define PINMUX_PA00H_CCL_IN0                       ((PIN_PA00H_CCL_IN0 << 16) | MUX_PA00H_CCL_IN0)
#define PORT_PA00H_CCL_IN0                         (_UINT32_(1) << 0)

#define PIN_PA01H_CCL_IN1                          _UINT32_(1) 
#define MUX_PA01H_CCL_IN1                          _UINT32_(7) 
#define PINMUX_PA01H_CCL_IN1                       ((PIN_PA01H_CCL_IN1 << 16) | MUX_PA01H_CCL_IN1)
#define PORT_PA01H_CCL_IN1                         (_UINT32_(1) << 1)

#define PIN_PA02H_CCL_IN2                          _UINT32_(2) 
#define MUX_PA02H_CCL_IN2                          _UINT32_(7) 
#define PINMUX_PA02H_CCL_IN2                       ((PIN_PA02H_CCL_IN2 << 16) | MUX_PA02H_CCL_IN2)
#define PORT_PA02H_CCL_IN2                         (_UINT32_(1) << 2)

#define PIN_PA08H_CCL_IN3                          _UINT32_(8) 
#define MUX_PA08H_CCL_IN3                          _UINT32_(7) 
#define PINMUX_PA08H_CCL_IN3                       ((PIN_PA08H_CCL_IN3 << 16) | MUX_PA08H_CCL_IN3)
#define PORT_PA08H_CCL_IN3                         (_UINT32_(1) << 8)

#define PIN_PA09H_CCL_IN4                          _UINT32_(9) 
#define MUX_PA09H_CCL_IN4                          _UINT32_(7) 
#define PINMUX_PA09H_CCL_IN4                       ((PIN_PA09H_CCL_IN4 << 16) | MUX_PA09H_CCL_IN4)
#define PORT_PA09H_CCL_IN4                         (_UINT32_(1) << 9)

#define PIN_PA10H_CCL_IN5                          _UINT32_(10)
#define MUX_PA10H_CCL_IN5                          _UINT32_(7) 
#define PINMUX_PA10H_CCL_IN5                       ((PIN_PA10H_CCL_IN5 << 16) | MUX_PA10H_CCL_IN5)
#define PORT_PA10H_CCL_IN5                         (_UINT32_(1) << 10)

#define PIN_PA16H_CCL_IN6                          _UINT32_(16)
#define MUX_PA16H_CCL_IN6                          _UINT32_(7) 
#define PINMUX_PA16H_CCL_IN6                       ((PIN_PA16H_CCL_IN6 << 16) | MUX_PA16H_CCL_IN6)
#define PORT_PA16H_CCL_IN6                         (_UINT32_(1) << 16)

#define PIN_PA17H_CCL_IN7                          _UINT32_(17)
#define MUX_PA17H_CCL_IN7                          _UINT32_(7) 
#define PINMUX_PA17H_CCL_IN7                       ((PIN_PA17H_CCL_IN7 << 16) | MUX_PA17H_CCL_IN7)
#define PORT_PA17H_CCL_IN7                         (_UINT32_(1) << 17)

